#Завдання 6
#Напишіть програму для аналізу фідбеку від відвідувачів курорту «Морська зірка», 
#яка повинна знаходити згадки про меню, спортзал, обслуговування(
#за кожне знайдене співпадіння нараховується 5% знижки на наступне відвідування). 
#Якщо фідбек перевищив 60 символів, відвідувачу надається додаткова знижка 15% на наступне відвідування.


feedback = input("Введіть ваш фідбек: ")
bonus = 0
if len(feedback) > 60:
    bonus += 15
    print("Знижка 15%")

if "меню" in feedback.lower(): 
    bonus += 5
    print("За 'меню' нараховано 5% знижки.")
        
if "спортзал" in feedback.lower():
    bonus += 5
    print("За 'спортзал'нараховано 5% знижки.")
        
if "обслуговування" in feedback.lower():
    bonus += 5
    print("За 'обслуговування' нараховано 5% знижки.")
        
print(f"\nЗагальний бонус на наступне відвідування: {bonus}%")
